In [1]:
import pandas as pd

# schalchemy dependencies
from sqlalchemy import create_engine, MetaData
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String, Numeric, Text, Float, ForeignKey
from sqlalchemy.orm import sessionmaker, relationship

In [ ]:
Base = declarative_base()

In [2]:
player_csv = pd.read_csv('player-list_2017.csv')
player_csv.head()
player_csv.reset_index(inplace = True )
player_csv.head()

,index,Unnamed: 0,player_id,position_id,position_name,team_id,team_name,Player_Name
0,0,0,365,1,gaurd,60,Xavier,Malcolm_Bernard
1,1,1,364,1,gaurd,60,Xavier,Quentin_Goodin
2,2,2,362,2,forward,60,Xavier,RaShid_Gaston
3,3,3,363,1,gaurd,60,Xavier,J.P._Macura
4,4,4,361,2,forward,60,Xavier,Tyrique_Jones

In [3]:
team_csv = pd.read_csv('team-list-2017.csv')
team_csv.head()

   id       name  region_id  mascot
0  63    Arizona          3     NaN
1   5   Arkansas          1     NaN
2  29     Baylor          2     NaN
3  58  Bucknell           3     NaN
4   9     Butler          1     NaN

In [4]:

# Create a filtered dataframe from specific columns for players
player_cols = [
                "team_name", "Player_Name","position_name"]
players= player_csv[player_cols].copy()

players.reset_index(inplace = True)
print (len(players))
players.head()

668

   index team_name      Player_Name position_name
0      0    Xavier  Malcolm_Bernard         gaurd
1      1    Xavier   Quentin_Goodin         gaurd
2      2    Xavier    RaShid_Gaston       forward
3      3    Xavier      J.P._Macura         gaurd
4      4    Xavier    Tyrique_Jones       forward

In [5]:

# Create a filtered dataframe from specific columns for teams
team_cols = ["id", 
                "name", "region_id"]
team_transformed= team_csv[team_cols].copy()


print (len(team_transformed))
team_transformed.head()

68

   id       name  region_id
0  63    Arizona          3
1   5   Arkansas          1
2  29     Baylor          2
3  58  Bucknell           3
4   9     Butler          1

In [ ]:
# 3 - west
#1 - south (17)
#2 east (19)
#4 midwest
def add_region(df):
    if df['region_id'] == 1:
        return 'SOUTH'
    if df['region_id'] == 2:
        return 'EAST'
    if df['region_id'] == 3:
        return 'WEST'
    if df['region_id'] == 4:
        return 'MIDWEST'

In [ ]:
team_transformed['region'] = team_transformed.apply(lambda df: add_region(df),axis=1)

In [ ]:
team_transformed.head()

In [ ]:
team_trans = team_transformed.drop('region_id',axis=1)

In [ ]:
teams = team_trans.sort_values(by=['id'])

In [ ]:
teams.head()

In [ ]:

class Teams(Base):
    __tablename__ = "teams"
    id = Column(Integer, primary_key = True)
    name = Column(String(255))
    region = Column(String(255))

In [ ]:

class Players(Base):
    __tablename__ = "players"
    index = Column(Integer, primary_key = True)
    team_name = Column(String(255))
    Player_Name = Column(String(255))
    position_name = Column(String(255))

In [ ]:
engine = create_engine("sqlite:///ncaa2017.sqlite")

In [ ]:
Base.metadata.create_all(engine)

In [ ]:
teams.to_sql("teams", engine, if_exists='append', index=False)
players.to_sql("players", engine, if_exists='append', index=False)

In [ ]:

engine.table_names()

In [ ]:
# Use the Inspector to explore the database and print the table names
inspector = inspect(engine)
inspector.get_table_names()

In [ ]:

engine.execute("SELECT * FROM teams LIMIT 1").fetchall()